## production: github
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| add    | `github_actions_secret.documentation_slack_webhook[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
15:11:58.451 STDOUT terraform:   + create
15:11:58.451 STDOUT terraform: Terraform will perform the following actions:
15:11:58.451 STDOUT terraform:   # github_actions_secret.documentation_slack_webhook[0] will be created
15:11:58.451 STDOUT terraform:   + resource "github_actions_secret" "documentation_slack_webhook" {
15:11:58.451 STDOUT terraform:       + created_at      = (known after apply)
15:11:58.451 STDOUT terraform:       + id              = (known after apply)
15:11:58.451 STDOUT terraform:       + plaintext_value = (sensitive value)
15:11:58.451 STDOUT terraform:       + repository      = "notification-documentation"
15:11:58.451 STDOUT terraform:       + secret_name     = "SLACK_WEBHOOK"
15:11:58.451 STDOUT terraform:       + updated_at      = (known after apply)
15:11:58.451 STDOUT terraform:     }
15:11:58.451 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
15:11:58.451 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
15:11:58.451 STDOUT terraform: Saved the plan to: plan.tfplan
15:11:58.451 STDOUT terraform: To perform exactly these actions, run the following command to apply:
15:11:58.451 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
